SoCXin/HC32F4A0/src/hc32f4a0rgtb_template/common/hc32f4a0rgtb.h
/**
 * @brief CMP
 */
typedef struct
{
    __IO uint8_t  MDR;
    __IO uint8_t  FIR;
    __IO uint8_t  OCR;
    __IO uint8_t  PMSR;
    __IO uint16_t TWSR;
    __IO uint16_t TWPR;
    __IO uint16_t VISR;
} M4_CMP_TypeDef;

/**
 * @brief CMU
 */
typedef struct
{
    __IO uint8_t  XTAL32CR;
    uint8_t RESERVED0[3];
    __IO uint8_t  XTAL32CFGR;
    uint8_t RESERVED1[15];
    __IO uint8_t  XTAL32NFR;
    uint8_t RESERVED2[7];
    __IO uint8_t  LRCCR;
    uint8_t RESERVED3[3];
    __IO uint8_t  RTCLRCCR;
    uint8_t RESERVED4[3];
    __IO uint8_t  LRCTRM;
    uint8_t RESERVED5[7];
    __IO uint8_t  RTCLRCTRM;
    uint8_t RESERVED6[2123];
    __IO uint8_t  XTALCFGR;
    uint8_t RESERVED7[29591];
    __IO uint16_t PERICKSEL;
    __IO uint16_t I2SCKSEL;
    uint8_t RESERVED8[4];
    __IO uint8_t  CANCKCFGR;
    uint8_t RESERVED9[7];
    __IO uint32_t SCFGR;
    __IO uint8_t  USBCKCFGR;
    uint8_t RESERVED10[1];
    __IO uint8_t  CKSWR;
    uint8_t RESERVED11[3];
    __IO uint8_t  PLLHCR;
    uint8_t RESERVED12[3];
    __IO uint8_t  PLLACR;
    uint8_t RESERVED13[3];
    __IO uint8_t  XTALCR;
    uint8_t RESERVED14[3];
    __IO uint8_t  HRCCR;
    uint8_t RESERVED15[1];
    __IO uint8_t  MRCCR;
    uint8_t RESERVED16[3];
    __IO uint8_t  OSCSTBSR;
    __IO uint8_t  MCO1CFGR;
    __IO uint8_t  MCO2CFGR;
    __IO uint8_t  TPIUCKCFGR;
    __IO uint8_t  XTALSTDCR;
    __IO uint8_t  XTALSTDSR;
    uint8_t RESERVED17[31];
    __IO uint8_t  MRCTRM;
    __IO uint8_t  HRCTRM;
    uint8_t RESERVED18[63];
    __IO uint8_t  XTALSTBCR;
    uint8_t RESERVED19[93];
    __IO uint32_t PLLHCFGR;
    __IO uint32_t PLLACFGR;
} M4_CMU_TypeDef;

/**
 * @brief CRC
 */
typedef struct
{
    __IO uint32_t CR;
    __IO uint32_t RESLT;
    uint8_t RESERVED0[120];
    __IO uint32_t DAT0;
    __IO uint32_t DAT1;
    __IO uint32_t DAT2;
    __IO uint32_t DAT3;
    __IO uint32_t DAT4;
    __IO uint32_t DAT5;
    __IO uint32_t DAT6;
    __IO uint32_t DAT7;
    __IO uint32_t DAT8;
    __IO uint32_t DAT9;
    __IO uint32_t DAT10;
    __IO uint32_t DAT11;
    __IO uint32_t DAT12;
    __IO uint32_t DAT13;
    __IO uint32_t DAT14;
    __IO uint32_t DAT15;
    __IO uint32_t DAT16;
    __IO uint32_t DAT17;
    __IO uint32_t DAT18;
    __IO uint32_t DAT19;
    __IO uint32_t DAT20;
    __IO uint32_t DAT21;
    __IO uint32_t DAT22;
    __IO uint32_t DAT23;
    __IO uint32_t DAT24;
    __IO uint32_t DAT25;
    __IO uint32_t DAT26;
    __IO uint32_t DAT27;
    __IO uint32_t DAT28;
    __IO uint32_t DAT29;
    __IO uint32_t DAT30;
    __IO uint32_t DAT31;
} M4_CRC_TypeDef;

/**
 * @brief CTC
 */
typedef struct
{
    __IO uint32_t CR1;
    __IO uint32_t CR2;
    __IO uint32_t STR;
} M4_CTC_TypeDef;

/**
 * @brief DAC
 */
typedef struct
{
    __IO uint16_t DADR1;
    __IO uint16_t DADR2;
    __IO uint16_t DACR;
    __IO uint16_t DAADPCR;
    uint8_t RESERVED0[20];
    __IO uint16_t DAOCR;
} M4_DAC_TypeDef;

/**
 * @brief DBGC
 */
typedef struct
{
    __IO uint32_t AUTHID0;
    __IO uint32_t AUTHID1;
    __IO uint32_t AUTHID2;
    __IO uint32_t RESV0;
    __IO uint32_t MCUSTAT;
    __IO uint32_t MCUCTL;
    __IO uint32_t FMCCTL;
    __IO uint32_t MCUDBGCSTAT;
    __IO uint32_t MCUSTPCTL;
    __IO uint32_t MCUTRACECTL;
    __IO uint32_t MCUSTPCTL2;
} M4_DBGC_TypeDef;

/**
 * @brief DCU
 */
typedef struct
{
    __IO uint32_t CTL;
    __IO uint32_t FLAG;
    __IO uint32_t DATA0;
    __IO uint32_t DATA1;
    __IO uint32_t DATA2;
    __IO uint32_t FLAGCLR;
    __IO uint32_t INTEVTSEL;
} M4_DCU_TypeDef;

/**
 * @brief DMA
 */
typedef struct
{
    __IO uint32_t EN;
    __IO uint32_t INTSTAT0;
    __IO uint32_t INTSTAT1;
    __IO uint32_t INTMASK0;
    __IO uint32_t INTMASK1;
    __IO uint32_t INTCLR0;
    __IO uint32_t INTCLR1;
    __IO uint32_t CHEN;
    __IO uint32_t REQSTAT;
    __IO uint32_t CHSTAT;
    uint8_t RESERVED0[4];
    __IO uint32_t RCFGCTL;
    uint8_t RESERVED1[4];
    __IO uint32_t CHENCLR;
    uint8_t RESERVED2[8];
    __IO uint32_t SAR0;
    __IO uint32_t DAR0;
    __IO uint32_t DTCTL0;
    union
    {
        __IO uint32_t RPT0;
        __IO uint32_t RPTB0;
    };
    union
    {
        __IO uint32_t SNSEQCTL0;
        __IO uint32_t SNSEQCTLB0;
    };
    union
    {
        __IO uint32_t DNSEQCTL0;
        __IO uint32_t DNSEQCTLB0;
    };
    __IO uint32_t LLP0;
    __IO uint32_t CHCTL0;
    __IO uint32_t MONSAR0;
    __IO uint32_t MONDAR0;
    __IO uint32_t MONDTCTL0;
    __IO uint32_t MONRPT0;
    __IO uint32_t MONSNSEQCTL0;
    __IO uint32_t MONDNSEQCTL0;
    uint8_t RESERVED3[8];
    __IO uint32_t SAR1;
    __IO uint32_t DAR1;
    __IO uint32_t DTCTL1;
    union
    {
        __IO uint32_t RPT1;
        __IO uint32_t RPTB1;
    };
    union
    {
        __IO uint32_t SNSEQCTL1;
        __IO uint32_t SNSEQCTLB1;
    };
    union
    {
        __IO uint32_t DNSEQCTL1;
        __IO uint32_t DNSEQCTLB1;
    };
    __IO uint32_t LLP1;
    __IO uint32_t CHCTL1;
    __IO uint32_t MONSAR1;
    __IO uint32_t MONDAR1;
    __IO uint32_t MONDTCTL1;
    __IO uint32_t MONRPT1;
    __IO uint32_t MONSNSEQCTL1;
    __IO uint32_t MONDNSEQCTL1;
    uint8_t RESERVED4[8];
    __IO uint32_t SAR2;
    __IO uint32_t DAR2;
    __IO uint32_t DTCTL2;
    union
    {
        __IO uint32_t RPT2;
        __IO uint32_t RPTB2;
    };
    union
    {
        __IO uint32_t SNSEQCTL2;
        __IO uint32_t SNSEQCTLB2;
    };
    union
    {
        __IO uint32_t DNSEQCTL2;
        __IO uint32_t DNSEQCTLB2;
    };
    __IO uint32_t LLP2;
    __IO uint32_t CHCTL2;
    __IO uint32_t MONSAR2;
    __IO uint32_t MONDAR2;
    __IO uint32_t MONDTCTL2;
    __IO uint32_t MONRPT2;
    __IO uint32_t MONSNSEQCTL2;
    __IO uint32_t MONDNSEQCTL2;
    uint8_t RESERVED5[8];
    __IO uint32_t SAR3;
    __IO uint32_t DAR3;
    __IO uint32_t DTCTL3;
    union
    {
        __IO uint32_t RPT3;
        __IO uint32_t RPTB3;
    };
    union
    {
        __IO uint32_t SNSEQCTL3;
        __IO uint32_t SNSEQCTLB3;
    };
    union
    {
        __IO uint32_t DNSEQCTL3;
        __IO uint32_t DNSEQCTLB3;
    };
    __IO uint32_t LLP3;
    __IO uint32_t CHCTL3;
    __IO uint32_t MONSAR3;
    __IO uint32_t MONDAR3;
    __IO uint32_t MONDTCTL3;
    __IO uint32_t MONRPT3;
    __IO uint32_t MONSNSEQCTL3;
    __IO uint32_t MONDNSEQCTL3;
    uint8_t RESERVED6[8];
    __IO uint32_t SAR4;
    __IO uint32_t DAR4;
    __IO uint32_t DTCTL4;
    union
    {
        __IO uint32_t RPT4;
        __IO uint32_t RPTB4;
    };
    union
    {
        __IO uint32_t SNSEQCTL4;
        __IO uint32_t SNSEQCTLB4;
    };
    union
    {
        __IO uint32_t DNSEQCTL4;
        __IO uint32_t DNSEQCTLB4;
    };
    __IO uint32_t LLP4;
    __IO uint32_t CHCTL4;
    __IO uint32_t MONSAR4;
    __IO uint32_t MONDAR4;
    __IO uint32_t MONDTCTL4;
    __IO uint32_t MONRPT4;
    __IO uint32_t MONSNSEQCTL4;
    __IO uint32_t MONDNSEQCTL4;
    uint8_t RESERVED7[8];
    __IO uint32_t SAR5;
    __IO uint32_t DAR5;
    __IO uint32_t DTCTL5;
    union
    {
        __IO uint32_t RPT5;
        __IO uint32_t RPTB5;
    };
    union
    {
        __IO uint32_t SNSEQCTL5;
        __IO uint32_t SNSEQCTLB5;
    };
    union
    {
        __IO uint32_t DNSEQCTL5;
        __IO uint32_t DNSEQCTLB5;
    };
    __IO uint32_t LLP5;
    __IO uint32_t CHCTL5;
    __IO uint32_t MONSAR5;
    __IO uint32_t MONDAR5;
    __IO uint32_t MONDTCTL5;
    __IO uint32_t MONRPT5;
    __IO uint32_t MONSNSEQCTL5;
    __IO uint32_t MONDNSEQCTL5;
    uint8_t RESERVED8[8];
    __IO uint32_t SAR6;
    __IO uint32_t DAR6;
    __IO uint32_t DTCTL6;
    union
    {
        __IO uint32_t RPT6;
        __IO uint32_t RPTB6;
    };
    union
    {
        __IO uint32_t SNSEQCTL6;
        __IO uint32_t SNSEQCTLB6;
    };
    union
    {
        __IO uint32_t DNSEQCTL6;
        __IO uint32_t DNSEQCTLB6;
    };
    __IO uint32_t LLP6;
    __IO uint32_t CHCTL6;
    __IO uint32_t MONSAR6;
    __IO uint32_t MONDAR6;
    __IO uint32_t MONDTCTL6;
    __IO uint32_t MONRPT6;
    __IO uint32_t MONSNSEQCTL6;
    __IO uint32_t MONDNSEQCTL6;
    uint8_t RESERVED9[8];
    __IO uint32_t SAR7;
    __IO uint32_t DAR7;
    __IO uint32_t DTCTL7;
    union
    {
        __IO uint32_t RPT7;
        __IO uint32_t RPTB7;
    };
    union
    {
        __IO uint32_t SNSEQCTL7;
        __IO uint32_t SNSEQCTLB7;
    };
    union
    {
        __IO uint32_t DNSEQCTL7;
        __IO uint32_t DNSEQCTLB7;
    };
    __IO uint32_t LLP7;
    __IO uint32_t CHCTL7;
    __IO uint32_t MONSAR7;
    __IO uint32_t MONDAR7;
    __IO uint32_t MONDTCTL7;
    __IO uint32_t MONRPT7;
    __IO uint32_t MONSNSEQCTL7;
    __IO uint32_t MONDNSEQCTL7;
} M4_DMA_TypeDef;

/**
 * @brief DMC
 */
typedef struct
{
    __IO uint32_t STSR;
    __IO uint32_t STCR;
    __IO uint32_t CMDR;
    __IO uint32_t CPCR;
    __IO uint32_t RFTR;
    __IO uint32_t TMCR_T_CASL;
    __IO uint32_t TMCR_T_DQSS;
    __IO uint32_t TMCR_T_MRD;
    __IO uint32_t TMCR_T_RAS;
    __IO uint32_t TMCR_T_RC;
    __IO uint32_t TMCR_T_RCD;
    __IO uint32_t TMCR_T_RFC;
    __IO uint32_t TMCR_T_RP;
    __IO uint32_t TMCR_T_RRD;
    __IO uint32_t TMCR_T_WR;
    __IO uint32_t TMCR_T_WTR;
    __IO uint32_t TMCR_T_XP;
    __IO uint32_t TMCR_T_XSR;
    __IO uint32_t TMCR_T_ESR;
    uint8_t RESERVED0[436];
    __IO uint32_t CSCR0;
    __IO uint32_t CSCR1;
    __IO uint32_t CSCR2;
    __IO uint32_t CSCR3;
    uint8_t RESERVED1[240];
    __IO uint32_t BACR;
} M4_DMC_TypeDef;

/**
 * @brief DVP
 */
typedef struct
{
    __IO uint32_t CTR;
    __IO uint32_t DTR;
    __IO uint32_t STR;
    __IO uint32_t IER;
    __IO uint32_t DMR;
    uint8_t RESERVED0[12];
    __IO uint32_t SSYNDR;
    __IO uint32_t SSYNMR;
    __IO uint32_t CPSFTR;
    __IO uint32_t CPSZER;
} M4_DVP_TypeDef;

/**
 * @brief EFM
 */
typedef struct
{
    __IO uint32_t FAPRT;
    __IO uint32_t KEY1;
    __IO uint32_t KEY2;
    uint8_t RESERVED0[8];
    __IO uint32_t FSTP;
    __IO uint32_t FRMC;
    __IO uint32_t FWMC;
    __IO uint32_t FSR;
    __IO uint32_t FSCLR;
    __IO uint32_t FITE;
    __IO uint32_t FSWP;
    uint8_t RESERVED1[16];
    __IO uint32_t CHIPID;
    uint8_t RESERVED2[12];
    __IO uint32_t UQID0;
    __IO uint32_t UQID1;
    __IO uint32_t UQID2;
    uint8_t RESERVED3[164];
    __IO uint32_t MMF_REMPRT;
    __IO uint32_t MMF_REMCR0;
    __IO uint32_t MMF_REMCR1;
    uint8_t RESERVED4[116];
    __IO uint32_t WLOCK;
    uint8_t RESERVED5[12];
    __IO uint32_t F0NWPRT0;
    __IO uint32_t F0NWPRT1;
    __IO uint32_t F0NWPRT2;
    __IO uint32_t F0NWPRT3;
    __IO uint32_t F1NWPRT0;
    __IO uint32_t F1NWPRT1;
    __IO uint32_t F1NWPRT2;
    __IO uint32_t F1NWPRT3;
} M4_EFM_TypeDef;

/**
 * @brief EMB
 */
typedef struct
{
    __IO uint32_t CTL1;
    __IO uint32_t CTL2;
    __IO uint32_t SOE;
    __IO uint32_t STAT;
    __IO uint32_t STATCLR;
    __IO uint32_t INTEN;
    __IO uint32_t RLSSEL;
} M4_EMB_TypeDef;

/**
 * @brief ETH
 */
typedef struct
{
    uint8_t RESERVED0[21520];
    __IO uint32_t MAC_IFCONFR;
    uint8_t RESERVED1[44012];
    __IO uint32_t MAC_CONFIGR;
    __IO uint32_t MAC_FLTCTLR;
    __IO uint32_t MAC_HASHTHR;
    __IO uint32_t MAC_HASHTLR;
    __IO uint32_t MAC_SMIADDR;
    __IO uint32_t MAC_SMIDATR;
    __IO uint32_t MAC_FLOCTLR;
    __IO uint32_t MAC_VTAFLTR;
    uint8_t RESERVED2[4];
    __IO uint32_t MAC_MACSTSR;
    __IO uint32_t MAC_RTWKFFR;
    __IO uint32_t MAC_PMTCTLR;
    uint8_t RESERVED3[8];
    __IO uint32_t MAC_INTSTSR;
    __IO uint32_t MAC_INTMSKR;
    __IO uint32_t MAC_MACADHR0;
    __IO uint32_t MAC_MACADLR0;
    __IO uint32_t MAC_MACADHR1;
    __IO uint32_t MAC_MACADLR1;
    __IO uint32_t MAC_MACADHR2;
    __IO uint32_t MAC_MACADLR2;
    __IO uint32_t MAC_MACADHR3;
    __IO uint32_t MAC_MACADLR3;
    __IO uint32_t MAC_MACADHR4;
    __IO uint32_t MAC_MACADLR4;
    uint8_t RESERVED4[152];
    __IO uint32_t MMC_MMCCTLR;
    __IO uint32_t MMC_REVSTSR;
    __IO uint32_t MMC_TRSSTSR;
    __IO uint32_t MMC_RITCTLR;
    __IO uint32_t MMC_TITCTLR;
    uint8_t RESERVED5[8];
    __IO uint32_t MMC_TXBRGFR;
    __IO uint32_t MMC_TXMUGFR;
    uint8_t RESERVED6[48];
    __IO uint32_t MMC_TXDEEFR;
    __IO uint32_t MMC_TXLCEFR;
    __IO uint32_t MMC_TXECEFR;
    __IO uint32_t MMC_TXCAEFR;
    uint8_t RESERVED7[4];
    __IO uint32_t MMC_TXUNGFR;
    __IO uint32_t MMC_TXEDEFR;
    uint8_t RESERVED8[28];
    __IO uint32_t MMC_RXBRGFR;
    __IO uint32_t MMC_RXMUGFR;
    __IO uint32_t MMC_RXCREFR;
    __IO uint32_t MMC_RXALEFR;
    __IO uint32_t MMC_RXRUEFR;
    uint8_t RESERVED9[36];
    __IO uint32_t MMC_RXUNGFR;
    __IO uint32_t MMC_RXLEEFR;
    __IO uint32_t MMC_RXOREFR;
    uint8_t RESERVED10[560];
    __IO uint32_t MAC_L34CTLR;
    __IO uint32_t MAC_L4PORTR;
    uint8_t RESERVED11[8];
    __IO uint32_t MAC_L3ADDRR0;
    __IO uint32_t MAC_L3ADDRR1;
    __IO uint32_t MAC_L3ADDRR2;
    __IO uint32_t MAC_L3ADDRR3;
    uint8_t RESERVED12[356];
    __IO uint32_t MAC_VTACTLR;
    __IO uint32_t MAC_VLAHTBR;
    uint8_t RESERVED13[372];
    __IO uint32_t PTP_TSPCTLR;
    __IO uint32_t PTP_TSPNSAR;
    __IO uint32_t PTP_TMSSECR;
    __IO uint32_t PTP_TMSNSER;
    __IO uint32_t PTP_TMUSECR;
    __IO uint32_t PTP_TMUNSER;
    __IO uint32_t PTP_TSPADDR;
    __IO uint32_t PTP_TMTSECR0;
    __IO uint32_t PTP_TMTNSER0;
    uint8_t RESERVED14[4];
    __IO uint32_t PTP_TSPSTSR;
    __IO uint32_t PTP_PPSCTLR;
    uint8_t RESERVED15[80];
    __IO uint32_t PTP_TMTSECR1;
    __IO uint32_t PTP_TMTNSER1;
    uint8_t RESERVED16[2168];
    __IO uint32_t DMA_BUSMODR;
    __IO uint32_t DMA_TXPOLLR;
    __IO uint32_t DMA_RXPOLLR;
    __IO uint32_t DMA_RXDLADR;
    __IO uint32_t DMA_TXDLADR;
    __IO uint32_t DMA_DMASTSR;
    __IO uint32_t DMA_OPRMODR;
    __IO uint32_t DMA_INTENAR;
    __IO uint32_t DMA_RFRCNTR;
    __IO uint32_t DMA_REVWDTR;
    uint8_t RESERVED17[32];
    __IO uint32_t DMA_CHTXDER;
    __IO uint32_t DMA_CHRXDER;
    __IO uint32_t DMA_CHTXBFR;
    __IO uint32_t DMA_CHRXBFR;
} M4_ETH_TypeDef;

/**
 * @brief FCM
 */
typedef struct
{
    __IO uint32_t LVR;
    __IO uint32_t UVR;
    __IO uint32_t CNTR;
    __IO uint32_t STR;
    __IO uint32_t MCCR;
    __IO uint32_t RCCR;
    __IO uint32_t RIER;
    __IO uint32_t SR;
    __IO uint32_t CLR;
} M4_FCM_TypeDef;

/**
 * @brief FMAC
 */
typedef struct
{
    __IO uint32_t ENR;
    __IO uint32_t CTR;
    __IO uint32_t IER;
    __IO uint32_t DTR;
    __IO uint32_t RTR0;
    __IO uint32_t RTR1;
    __IO uint32_t STR;
    uint8_t RESERVED0[4];
    __IO uint32_t COR0;
    __IO uint32_t COR1;
    __IO uint32_t COR2;
    __IO uint32_t COR3;
    __IO uint32_t COR4;
    __IO uint32_t COR5;
    __IO uint32_t COR6;
    __IO uint32_t COR7;
    __IO uint32_t COR8;
    __IO uint32_t COR9;
    __IO uint32_t COR10;
    __IO uint32_t COR11;
    __IO uint32_t COR12;
    __IO uint32_t COR13;
    __IO uint32_t COR14;
    __IO uint32_t COR15;
    __IO uint32_t COR16;
} M4_FMAC_TypeDef;

/**
 * @brief GPIO
 */
typedef struct
{
    __IO uint16_t PIDRA;
    uint8_t RESERVED0[2];
    __IO uint16_t PODRA;
    __IO uint16_t POERA;
    __IO uint16_t POSRA;
    __IO uint16_t PORRA;
    __IO uint16_t POTRA;
    uint8_t RESERVED1[2];
    __IO uint16_t PIDRB;
    uint8_t RESERVED2[2];
    __IO uint16_t PODRB;
    __IO uint16_t POERB;
    __IO uint16_t POSRB;
    __IO uint16_t PORRB;
    __IO uint16_t POTRB;
    uint8_t RESERVED3[2];
    __IO uint16_t PIDRC;
    uint8_t RESERVED4[2];
    __IO uint16_t PODRC;
    __IO uint16_t POERC;
    __IO uint16_t POSRC;
    __IO uint16_t PORRC;
    __IO uint16_t POTRC;
    uint8_t RESERVED5[2];
    __IO uint16_t PIDRD;
    uint8_t RESERVED6[2];
    __IO uint16_t PODRD;
    __IO uint16_t POERD;
    __IO uint16_t POSRD;
    __IO uint16_t PORRD;
    __IO uint16_t POTRD;
    uint8_t RESERVED7[2];
    __IO uint16_t PIDRE;
    uint8_t RESERVED8[2];
    __IO uint16_t PODRE;
    __IO uint16_t POERE;
    __IO uint16_t POSRE;
    __IO uint16_t PORRE;
    __IO uint16_t POTRE;
    uint8_t RESERVED9[2];
    __IO uint16_t PIDRF;
    uint8_t RESERVED10[2];
    __IO uint16_t PODRF;
    __IO uint16_t POERF;
    __IO uint16_t POSRF;
    __IO uint16_t PORRF;
    __IO uint16_t POTRF;
    uint8_t RESERVED11[2];
    __IO uint16_t PIDRG;
    uint8_t RESERVED12[2];
    __IO uint16_t PODRG;
    __IO uint16_t POERG;
    __IO uint16_t POSRG;
    __IO uint16_t PORRG;
    __IO uint16_t POTRG;
    uint8_t RESERVED13[2];
    __IO uint16_t PIDRH;
    uint8_t RESERVED14[2];
    __IO uint16_t PODRH;
    __IO uint16_t POERH;
    __IO uint16_t POSRH;
    __IO uint16_t PORRH;
    __IO uint16_t POTRH;
    uint8_t RESERVED15[2];
    __IO uint16_t PIDRI;
    uint8_t RESERVED16[2];
    __IO uint16_t PODRI;
    __IO uint16_t POERI;
    __IO uint16_t POSRI;
    __IO uint16_t PORRI;
    __IO uint16_t POTRI;
    uint8_t RESERVED17[870];
    __IO uint16_t PSPCR;
    uint8_t RESERVED18[2];
    __IO uint16_t PCCR;
    __IO uint16_t PINAER;
    __IO uint16_t PWPR;
    uint8_t RESERVED19[2];
    __IO uint16_t PCRA0;
    __IO uint16_t PFSRA0;
    __IO uint16_t PCRA1;
    __IO uint16_t PFSRA1;
    __IO uint16_t PCRA2;
    __IO uint16_t PFSRA2;
    __IO uint16_t PCRA3;
    __IO uint16_t PFSRA3;
    __IO uint16_t PCRA4;
    __IO uint16_t PFSRA4;
    __IO uint16_t PCRA5;
    __IO uint16_t PFSRA5;
    __IO uint16_t PCRA6;
    __IO uint16_t PFSRA6;
    __IO uint16_t PCRA7;
    __IO uint16_t PFSRA7;
    __IO uint16_t PCRA8;
    __IO uint16_t PFSRA8;
    __IO uint16_t PCRA9;
    __IO uint16_t PFSRA9;
    __IO uint16_t PCRA10;
    __IO uint16_t PFSRA10;
    __IO uint16_t PCRA11;
    __IO uint16_t PFSRA11;
    __IO uint16_t PCRA12;
    __IO uint16_t PFSRA12;
    __IO uint16_t PCRA13;
    __IO uint16_t PFSRA13;
    __IO uint16_t PCRA14;
    __IO uint16_t PFSRA14;
    __IO uint16_t PCRA15;
    __IO uint16_t PFSRA15;
    __IO uint16_t PCRB0;
    __IO uint16_t PFSRB0;
    __IO uint16_t PCRB1;
    __IO uint16_t PFSRB1;
    __IO uint16_t PCRB2;
    __IO uint16_t PFSRB2;
    __IO uint16_t PCRB3;
    __IO uint16_t PFSRB3;
    __IO uint16_t PCRB4;
    __IO uint16_t PFSRB4;
    __IO uint16_t PCRB5;
    __IO uint16_t PFSRB5;
    __IO uint16_t PCRB6;
    __IO uint16_t PFSRB6;
    __IO uint16_t PCRB7;
    __IO uint16_t PFSRB7;
    __IO uint16_t PCRB8;
    __IO uint16_t PFSRB8;
    __IO uint16_t PCRB9;
    __IO uint16_t PFSRB9;
    __IO uint16_t PCRB10;
    __IO uint16_t PFSRB10;
    __IO uint16_t PCRB11;
    __IO uint16_t PFSRB11;
    __IO uint16_t PCRB12;
    __IO uint16_t PFSRB12;
    __IO uint16_t PCRB13;
    __IO uint16_t PFSRB13;
    __IO uint16_t PCRB14;
    __IO uint16_t PFSRB14;
    __IO uint16_t PCRB15;
    __IO uint16_t PFSRB15;
    __IO uint16_t PCRC0;
    __IO uint16_t PFSRC0;
    __IO uint16_t PCRC1;
    __IO uint16_t PFSRC1;
    __IO uint16_t PCRC2;
    __IO uint16_t PFSRC2;
    __IO uint16_t PCRC3;
    __IO uint16_t PFSRC3;
    __IO uint16_t PCRC4;
    __IO uint16_t PFSRC4;
    __IO uint16_t PCRC5;
    __IO uint16_t PFSRC5;
    __IO uint16_t PCRC6;
    __IO uint16_t PFSRC6;
    __IO uint16_t PCRC7;
    __IO uint16_t PFSRC7;
    __IO uint16_t PCRC8;
    __IO uint16_t PFSRC8;
    __IO uint16_t PCRC9;
    __IO uint16_t PFSRC9;
    __IO uint16_t PCRC10;
    __IO uint16_t PFSRC10;
    __IO uint16_t PCRC11;
    __IO uint16_t PFSRC11;
    __IO uint16_t PCRC12;
    __IO uint16_t PFSRC12;
    __IO uint16_t PCRC13;
    __IO uint16_t PFSRC13;
    __IO uint16_t PCRC14;
    __IO uint16_t PFSRC14;
    __IO uint16_t PCRC15;
    __IO uint16_t PFSRC15;
    __IO uint16_t PCRD0;
    __IO uint16_t PFSRD0;
    __IO uint16_t PCRD1;
    __IO uint16_t PFSRD1;
    __IO uint16_t PCRD2;
    __IO uint16_t PFSRD2;
    __IO uint16_t PCRD3;
    __IO uint16_t PFSRD3;
    __IO uint16_t PCRD4;
    __IO uint16_t PFSRD4;
    __IO uint16_t PCRD5;
    __IO uint16_t PFSRD5;
    __IO uint16_t PCRD6;
    __IO uint16_t PFSRD6;
    __IO uint16_t PCRD7;
    __IO uint16_t PFSRD7;
    __IO uint16_t PCRD8;
    __IO uint16_t PFSRD8;
    __IO uint16_t PCRD9;
    __IO uint16_t PFSRD9;
    __IO uint16_t PCRD10;
    __IO uint16_t PFSRD10;
    __IO uint16_t PCRD11;
    __IO uint16_t PFSRD11;
    __IO uint16_t PCRD12;
    __IO uint16_t PFSRD12;
    __IO uint16_t PCRD13;
    __IO uint16_t PFSRD13;
    __IO uint16_t PCRD14;
    __IO uint16_t PFSRD14;
    __IO uint16_t PCRD15;
    __IO uint16_t PFSRD15;
    __IO uint16_t PCRE0;
    __IO uint16_t PFSRE0;
    __IO uint16_t PCRE1;
    __IO uint16_t PFSRE1;
    __IO uint16_t PCRE2;
    __IO uint16_t PFSRE2;
    __IO uint16_t PCRE3;
    __IO uint16_t PFSRE3;
    __IO uint16_t PCRE4;
    __IO uint16_t PFSRE4;
    __IO uint16_t PCRE5;
    __IO uint16_t PFSRE5;
    __IO uint16_t PCRE6;
    __IO uint16_t PFSRE6;
    __IO uint16_t PCRE7;
    __IO uint16_t PFSRE7;
    __IO uint16_t PCRE8;
    __IO uint16_t PFSRE8;
    __IO uint16_t PCRE9;
    __IO uint16_t PFSRE9;
    __IO uint16_t PCRE10;
    __IO uint16_t PFSRE10;
    __IO uint16_t PCRE11;
    __IO uint16_t PFSRE11;
    __IO uint16_t PCRE12;
    __IO uint16_t PFSRE12;
    __IO uint16_t PCRE13;
    __IO uint16_t PFSRE13;
    __IO uint16_t PCRE14;
    __IO uint16_t PFSRE14;
    __IO uint16_t PCRE15;
    __IO uint16_t PFSRE15;
    __IO uint16_t PCRF0;
    __IO uint16_t PFSRF0;
    __IO uint16_t PCRF1;
    __IO uint16_t PFSRF1;
    __IO uint16_t PCRF2;
    __IO uint16_t PFSRF2;
    __IO uint16_t PCRF3;
    __IO uint16_t PFSRF3;
    __IO uint16_t PCRF4;
    __IO uint16_t PFSRF4;
    __IO uint16_t PCRF5;
    __IO uint16_t PFSRF5;
    __IO uint16_t PCRF6;
    __IO uint16_t PFSRF6;
    __IO uint16_t PCRF7;
    __IO uint16_t PFSRF7;
    __IO uint16_t PCRF8;
    __IO uint16_t PFSRF8;
    __IO uint16_t PCRF9;
    __IO uint16_t PFSRF9;
    __IO uint16_t PCRF10;
    __IO uint16_t PFSRF10;
    __IO uint16_t PCRF11;
    __IO uint16_t PFSRF11;
    __IO uint16_t PCRF12;
    __IO uint16_t PFSRF12;
    __IO uint16_t PCRF13;
    __IO uint16_t PFSRF13;
    __IO uint16_t PCRF14;
    __IO uint16_t PFSRF14;
    __IO uint16_t PCRF15;
    __IO uint16_t PFSRF15;
    __IO uint16_t PCRG0;
    __IO uint16_t PFSRG0;
    __IO uint16_t PCRG1;
    __IO uint16_t PFSRG1;
    __IO uint16_t PCRG2;
    __IO uint16_t PFSRG2;
    __IO uint16_t PCRG3;
    __IO uint16_t PFSRG3;
    __IO uint16_t PCRG4;
    __IO uint16_t PFSRG4;
    __IO uint16_t PCRG5;
    __IO uint16_t PFSRG5;
    __IO uint16_t PCRG6;
    __IO uint16_t PFSRG6;
    __IO uint16_t PCRG7;
    __IO uint16_t PFSRG7;
    __IO uint16_t PCRG8;
    __IO uint16_t PFSRG8;
    __IO uint16_t PCRG9;
    __IO uint16_t PFSRG9;
    __IO uint16_t PCRG10;
    __IO uint16_t PFSRG10;
    __IO uint16_t PCRG11;
    __IO uint16_t PFSRG11;
    __IO uint16_t PCRG12;
    __IO uint16_t PFSRG12;
    __IO uint16_t PCRG13;
    __IO uint16_t PFSRG13;
    __IO uint16_t PCRG14;
    __IO uint16_t PFSRG14;
    __IO uint16_t PCRG15;
    __IO uint16_t PFSRG15;
    __IO uint16_t PCRH0;
    __IO uint16_t PFSRH0;
    __IO uint16_t PCRH1;
    __IO uint16_t PFSRH1;
    uint8_t RESERVED20[104];
    __IO uint16_t PCRI12;
    __IO uint16_t PFSRI12;
    __IO uint16_t PCRI13;
    __IO uint16_t PFSRI13;
} M4_GPIO_TypeDef;

/**
 * @brief HASH
 */
typedef struct
{
    __IO uint32_t CR;
    uint8_t RESERVED0[12];
    __IO uint32_t HR7;
    __IO uint32_t HR6;
    __IO uint32_t HR5;
    __IO uint32_t HR4;
    __IO uint32_t HR3;
    __IO uint32_t HR2;
    __IO uint32_t HR1;
    __IO uint32_t HR0;
    uint8_t RESERVED1[16];
    __IO uint32_t DR15;
    __IO uint32_t DR14;
    __IO uint32_t DR13;
    __IO uint32_t DR12;
    __IO uint32_t DR11;
    __IO uint32_t DR10;
    __IO uint32_t DR9;
    __IO uint32_t DR8;
    __IO uint32_t DR7;
    __IO uint32_t DR6;
    __IO uint32_t DR5;
    __IO uint32_t DR4;
    __IO uint32_t DR3;
    __IO uint32_t DR2;
    __IO uint32_t DR1;
    __IO uint32_t DR0;
} M4_HASH_TypeDef;

