SoCXin/HC32F4A0/src/hc32f4a0rgtb_template/common/hc32f4a0rgtb.h
/*  Bit definition for NFC_ECC_SYND15_2 register  */
#define NFC_ECC_SYND15_2_S5_POS                        (0U)
#define NFC_ECC_SYND15_2_S5                            (0x00001FFFUL)
#define NFC_ECC_SYND15_2_S6_POS                        (16U)
#define NFC_ECC_SYND15_2_S6                            (0x1FFF0000UL)

/*  Bit definition for NFC_ECC_SYND15_3 register  */
#define NFC_ECC_SYND15_3_S7_POS                        (0U)
#define NFC_ECC_SYND15_3_S7                            (0x00001FFFUL)
#define NFC_ECC_SYND15_3_S8_POS                        (16U)
#define NFC_ECC_SYND15_3_S8                            (0x1FFF0000UL)

/*******************************************************************************
                Bit definition for Peripheral OTS
*******************************************************************************/
/*  Bit definition for OTS_PDR register  */
#define OTS_PDR_TSPD1_POS                              (0U)
#define OTS_PDR_TSPD1                                  (0x0000FFFFUL)
#define OTS_PDR_TSPD2_POS                              (16U)
#define OTS_PDR_TSPD2                                  (0xFFFF0000UL)

/*  Bit definition for OTS_CTL register  */
#define OTS_CTL_OTSST_POS                              (0U)
#define OTS_CTL_OTSST                                  (0x0001U)
#define OTS_CTL_OTSCK_POS                              (1U)
#define OTS_CTL_OTSCK                                  (0x0002U)
#define OTS_CTL_OTSIE_POS                              (2U)
#define OTS_CTL_OTSIE                                  (0x0004U)
#define OTS_CTL_TSSTP_POS                              (3U)
#define OTS_CTL_TSSTP                                  (0x0008U)

/*  Bit definition for OTS_DR register  */
#define OTS_DR                                         (0xFFFFU)

/*  Bit definition for OTS_ECR register  */
#define OTS_ECR                                        (0xFFFFU)

/*  Bit definition for OTS_LPR register  */
#define OTS_LPR_TSOFS_POS                              (0U)
#define OTS_LPR_TSOFS                                  (0x000000FFUL)
#define OTS_LPR_TSSLP_POS                              (8U)
#define OTS_LPR_TSSLP                                  (0xFFFFFF00UL)

/*******************************************************************************
                Bit definition for Peripheral PERIC
*******************************************************************************/
/*  Bit definition for PERIC_USB_SYCTLREG register  */
#define PERIC_USB_SYCTLREG_USBFS_DFB_POS               (0U)
#define PERIC_USB_SYCTLREG_USBFS_DFB                   (0x00000001UL)
#define PERIC_USB_SYCTLREG_USBFS_SOFEN_POS             (1U)
#define PERIC_USB_SYCTLREG_USBFS_SOFEN                 (0x00000002UL)
#define PERIC_USB_SYCTLREG_USBHS_DFB_POS               (8U)
#define PERIC_USB_SYCTLREG_USBHS_DFB                   (0x00000100UL)
#define PERIC_USB_SYCTLREG_USBHS_SOFEN_POS             (9U)
#define PERIC_USB_SYCTLREG_USBHS_SOFEN                 (0x00000200UL)
#define PERIC_USB_SYCTLREG_USBHS_FSPHYE_POS            (10U)
#define PERIC_USB_SYCTLREG_USBHS_FSPHYE                (0x00000400UL)
#define PERIC_USB_SYCTLREG_USBFS_NFS_POS               (16U)
#define PERIC_USB_SYCTLREG_USBFS_NFS                   (0x00030000UL)
#define PERIC_USB_SYCTLREG_USBFS_NFS_0                 (0x00010000UL)
#define PERIC_USB_SYCTLREG_USBFS_NFS_1                 (0x00020000UL)
#define PERIC_USB_SYCTLREG_USBFS_NFE_POS               (18U)
#define PERIC_USB_SYCTLREG_USBFS_NFE                   (0x00040000UL)
#define PERIC_USB_SYCTLREG_USBHS_NFS_POS               (24U)
#define PERIC_USB_SYCTLREG_USBHS_NFS                   (0x03000000UL)
#define PERIC_USB_SYCTLREG_USBHS_NFS_0                 (0x01000000UL)
#define PERIC_USB_SYCTLREG_USBHS_NFS_1                 (0x02000000UL)
#define PERIC_USB_SYCTLREG_USBHS_NFE_POS               (26U)
#define PERIC_USB_SYCTLREG_USBHS_NFE                   (0x04000000UL)

/*  Bit definition for PERIC_SDIOC_SYCTLREG register  */
#define PERIC_SDIOC_SYCTLREG_SELMMC1_POS               (1U)
#define PERIC_SDIOC_SYCTLREG_SELMMC1                   (0x00000002UL)
#define PERIC_SDIOC_SYCTLREG_SELMMC2_POS               (3U)
#define PERIC_SDIOC_SYCTLREG_SELMMC2                   (0x00000008UL)

/*  Bit definition for PERIC_NFC_STCR register  */
#define PERIC_NFC_STCR_OPENP                           (0x00000001UL)

/*  Bit definition for PERIC_NFC_ENAR register  */
#define PERIC_NFC_ENAR_NFCEN_POS                       (2U)
#define PERIC_NFC_ENAR_NFCEN                           (0x00000004UL)

/*  Bit definition for PERIC_SMC_ENAR register  */
#define PERIC_SMC_ENAR_SMCEN_POS                       (1U)
#define PERIC_SMC_ENAR_SMCEN                           (0x00000002UL)

/*  Bit definition for PERIC_DMC_ENAR register  */
#define PERIC_DMC_ENAR_DMCEN                           (0x00000001UL)

/*  Bit definition for PERIC_USART1_NFC register  */
#define PERIC_USART1_NFC_USASRT1_NFS_POS               (0U)
#define PERIC_USART1_NFC_USASRT1_NFS                   (0x00000003UL)
#define PERIC_USART1_NFC_USASRT1_NFS_0                 (0x00000001UL)
#define PERIC_USART1_NFC_USASRT1_NFS_1                 (0x00000002UL)
#define PERIC_USART1_NFC_USART1_NFE_POS                (2U)
#define PERIC_USART1_NFC_USART1_NFE                    (0x00000004UL)

/*  Bit definition for PERIC_NFC_STSR register  */
#define PERIC_NFC_STSR_CHIP_BUSY_POS                   (0U)
#define PERIC_NFC_STSR_CHIP_BUSY                       (0x000000FFUL)
#define PERIC_NFC_STSR_CHIP_BUSY_0                     (0x00000001UL)
#define PERIC_NFC_STSR_CHIP_BUSY_1                     (0x00000002UL)
#define PERIC_NFC_STSR_CHIP_BUSY_2                     (0x00000004UL)
#define PERIC_NFC_STSR_CHIP_BUSY_3                     (0x00000008UL)
#define PERIC_NFC_STSR_CHIP_BUSY_4                     (0x00000010UL)
#define PERIC_NFC_STSR_CHIP_BUSY_5                     (0x00000020UL)
#define PERIC_NFC_STSR_CHIP_BUSY_6                     (0x00000040UL)
#define PERIC_NFC_STSR_CHIP_BUSY_7                     (0x00000080UL)
#define PERIC_NFC_STSR_PECC_POS                        (8U)
#define PERIC_NFC_STSR_PECC                            (0x00000100UL)

