SoCXin/HC32F4A0/src/hc32f4a0rgtb_template/common/hc32f4a0rgtb.h
typedef struct
{
    __IO uint32_t POS00;
    __IO uint32_t POS01;
    __IO uint32_t POS02;
    __IO uint32_t POS03;
    __IO uint32_t POS04;
    __IO uint32_t POS05;
    __IO uint32_t POS06;
    __IO uint32_t POS07;
    __IO uint32_t POS08;
    __IO uint32_t POS09;
    __IO uint32_t POS10;
    __IO uint32_t POS11;
    __IO uint32_t POS12;
    __IO uint32_t POS13;
    __IO uint32_t POS14;
    __IO uint32_t POS15;
} stc_gpio_posrg_bit_t;

typedef struct
{
    __IO uint32_t POR00;
    __IO uint32_t POR01;
    __IO uint32_t POR02;
    __IO uint32_t POR03;
    __IO uint32_t POR04;
    __IO uint32_t POR05;
    __IO uint32_t POR06;
    __IO uint32_t POR07;
    __IO uint32_t POR08;
    __IO uint32_t POR09;
    __IO uint32_t POR10;
    __IO uint32_t POR11;
    __IO uint32_t POR12;
    __IO uint32_t POR13;
    __IO uint32_t POR14;
    __IO uint32_t POR15;
} stc_gpio_porrg_bit_t;

typedef struct
{
    __IO uint32_t POT00;
    __IO uint32_t POT01;
    __IO uint32_t POT02;
    __IO uint32_t POT03;
    __IO uint32_t POT04;
    __IO uint32_t POT05;
    __IO uint32_t POT06;
    __IO uint32_t POT07;
    __IO uint32_t POT08;
    __IO uint32_t POT09;
    __IO uint32_t POT10;
    __IO uint32_t POT11;
    __IO uint32_t POT12;
    __IO uint32_t POT13;
    __IO uint32_t POT14;
    __IO uint32_t POT15;
} stc_gpio_potrg_bit_t;

typedef struct
{
    __IO uint32_t PIN00;
    __IO uint32_t PIN01;
    uint32_t RESERVED0[14];
} stc_gpio_pidrh_bit_t;

typedef struct
{
    __IO uint32_t POUT00;
    __IO uint32_t POUT01;
    uint32_t RESERVED0[14];
} stc_gpio_podrh_bit_t;

typedef struct
{
    __IO uint32_t POUTE00;
    __IO uint32_t POUTE01;
    uint32_t RESERVED0[14];
} stc_gpio_poerh_bit_t;

typedef struct
{
    __IO uint32_t POS00;
    __IO uint32_t POS01;
    uint32_t RESERVED0[14];
} stc_gpio_posrh_bit_t;

typedef struct
{
    __IO uint32_t POR00;
    __IO uint32_t POR01;
    uint32_t RESERVED0[14];
} stc_gpio_porrh_bit_t;

typedef struct
{
    __IO uint32_t POT00;
    __IO uint32_t POT01;
    uint32_t RESERVED0[14];
} stc_gpio_potrh_bit_t;

typedef struct
{
    uint32_t RESERVED0[12];
    __IO uint32_t PIN12;
    __IO uint32_t PIN13;
    uint32_t RESERVED1[2];
} stc_gpio_pidri_bit_t;

typedef struct
{
    uint32_t RESERVED0[12];
    __IO uint32_t POUT12;
    __IO uint32_t POUT13;
    uint32_t RESERVED1[2];
} stc_gpio_podri_bit_t;

typedef struct
{
    uint32_t RESERVED0[12];
    __IO uint32_t POUTE12;
    __IO uint32_t POUTE13;
    uint32_t RESERVED1[2];
} stc_gpio_poeri_bit_t;

typedef struct
{
    uint32_t RESERVED0[12];
    __IO uint32_t POS12;
    __IO uint32_t POS13;
    uint32_t RESERVED1[2];
} stc_gpio_posri_bit_t;

typedef struct
{
    uint32_t RESERVED0[12];
    __IO uint32_t POR12;
    __IO uint32_t POR13;
    uint32_t RESERVED1[2];
} stc_gpio_porri_bit_t;

typedef struct
{
    uint32_t RESERVED0[12];
    __IO uint32_t POT12;
    __IO uint32_t POT13;
    uint32_t RESERVED1[2];
} stc_gpio_potri_bit_t;

typedef struct
{
    __IO uint32_t SPFE0;
    __IO uint32_t SPFE1;
    __IO uint32_t SPFE2;
    __IO uint32_t SPFE3;
    __IO uint32_t SPFE4;
    uint32_t RESERVED0[11];
} stc_gpio_pspcr_bit_t;

typedef struct
{
    uint32_t RESERVED0[16];
} stc_gpio_pccr_bit_t;

typedef struct
{
    __IO uint32_t PINAE0;
    __IO uint32_t PINAE1;
    __IO uint32_t PINAE2;
    __IO uint32_t PINAE3;
    __IO uint32_t PINAE4;
    __IO uint32_t PINAE5;
    __IO uint32_t PINAE6;
    __IO uint32_t PINAE7;
    __IO uint32_t PINAE8;
    uint32_t RESERVED0[7];
} stc_gpio_pinaer_bit_t;

typedef struct
{
    __IO uint32_t WE;
    uint32_t RESERVED0[15];
} stc_gpio_pwpr_bit_t;

typedef struct
{
    __IO uint32_t POUT;
    __IO uint32_t POUTE;
    __IO uint32_t NOD;
    uint32_t RESERVED0[1];
    __IO uint32_t DRV0;
    __IO uint32_t DRV1;
    __IO uint32_t PUU;
    uint32_t RESERVED1[1];
    __IO uint32_t PIN;
    __IO uint32_t INVE;
    __IO uint32_t CINSEL;
    uint32_t RESERVED2[1];
    __IO uint32_t INTE;
    uint32_t RESERVED3[1];
    __IO uint32_t LTE;
    __IO uint32_t DDIS;
} stc_gpio_pcr_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
    __IO uint32_t BFE;
    uint32_t RESERVED1[7];
} stc_gpio_pfsr_bit_t;

typedef struct
{
    __IO uint32_t START;
    __IO uint32_t FST_GRP;
    __IO uint32_t KMSG_END;
    uint32_t RESERVED0[1];
    __IO uint32_t MODE0;
    __IO uint32_t MODE1;
    __IO uint32_t LKEY;
    uint32_t RESERVED1[1];
    __IO uint32_t BUSY;
    __IO uint32_t CYC_END;
    __IO uint32_t HMAC_END;
    uint32_t RESERVED2[3];
    __IO uint32_t HCIE;
    __IO uint32_t HEIE;
    uint32_t RESERVED3[16];
} stc_hash_cr_bit_t;

typedef struct
{
    uint32_t RESERVED0[29];
    __IO uint32_t NE;
    __IO uint32_t PE;
    __IO uint32_t EN;
} stc_hrpwm_cr_bit_t;

typedef struct
{
    uint32_t RESERVED0[12];
    __IO uint32_t ENDF;
    uint32_t RESERVED1[2];
    __IO uint32_t CALEN;
    uint32_t RESERVED2[16];
} stc_hrpwm_calcr_bit_t;

typedef struct
{
    __IO uint32_t PE;
    __IO uint32_t SMBUS;
    __IO uint32_t SMBALRTEN;
    __IO uint32_t SMBDEFAULTEN;
    __IO uint32_t SMBHOSTEN;
    uint32_t RESERVED0[1];
    __IO uint32_t ENGC;
    __IO uint32_t RESTART;
    __IO uint32_t START;
    __IO uint32_t STOP;
    __IO uint32_t ACK;
    uint32_t RESERVED1[4];
    __IO uint32_t SWRST;
    uint32_t RESERVED2[16];
} stc_i2c_cr1_bit_t;

typedef struct
{
    __IO uint32_t STARTIE;
    __IO uint32_t SLADDR0IE;
    __IO uint32_t SLADDR1IE;
    __IO uint32_t TENDIE;
    __IO uint32_t STOPIE;
    uint32_t RESERVED0[1];
    __IO uint32_t RFULLIE;
    __IO uint32_t TEMPTYIE;
    uint32_t RESERVED1[1];
    __IO uint32_t ARLOIE;
    uint32_t RESERVED2[2];
    __IO uint32_t NACKIE;
    uint32_t RESERVED3[1];
    __IO uint32_t TMOUTIE;
    uint32_t RESERVED4[5];
    __IO uint32_t GENCALLIE;
    __IO uint32_t SMBDEFAULTIE;
    __IO uint32_t SMHOSTIE;
    __IO uint32_t SMBALRTIE;
    uint32_t RESERVED5[8];
} stc_i2c_cr2_bit_t;

typedef struct
{
    __IO uint32_t TMOUTEN;
    __IO uint32_t LTMOUT;
    __IO uint32_t HTMOUT;
    uint32_t RESERVED0[4];
    __IO uint32_t FACKEN;
    uint32_t RESERVED1[24];
} stc_i2c_cr3_bit_t;

typedef struct
{
    uint32_t RESERVED0[10];
    __IO uint32_t BUSWAIT;
    uint32_t RESERVED1[21];
} stc_i2c_cr4_bit_t;

typedef struct
{
    uint32_t RESERVED0[12];
    __IO uint32_t SLADDR0EN;
    uint32_t RESERVED1[2];
    __IO uint32_t ADDRMOD0;
    uint32_t RESERVED2[16];
} stc_i2c_slr0_bit_t;

typedef struct
{
    uint32_t RESERVED0[12];
    __IO uint32_t SLADDR1EN;
    uint32_t RESERVED1[2];
    __IO uint32_t ADDRMOD1;
    uint32_t RESERVED2[16];
} stc_i2c_slr1_bit_t;

typedef struct
{
    __IO uint32_t STARTF;
    __IO uint32_t SLADDR0F;
    __IO uint32_t SLADDR1F;
    __IO uint32_t TENDF;
    __IO uint32_t STOPF;
    uint32_t RESERVED0[1];
    __IO uint32_t RFULLF;
    __IO uint32_t TEMPTYF;
    uint32_t RESERVED1[1];
    __IO uint32_t ARLOF;
    __IO uint32_t ACKRF;
    uint32_t RESERVED2[1];
    __IO uint32_t NACKF;
    uint32_t RESERVED3[1];
    __IO uint32_t TMOUTF;
    uint32_t RESERVED4[1];
    __IO uint32_t MSL;
    __IO uint32_t BUSY;
    __IO uint32_t TRA;
    uint32_t RESERVED5[1];
    __IO uint32_t GENCALLF;
    __IO uint32_t SMBDEFAULTF;
    __IO uint32_t SMBHOSTF;
    __IO uint32_t SMBALRTF;
    uint32_t RESERVED6[8];
} stc_i2c_sr_bit_t;

typedef struct
{
    __IO uint32_t STARTFCLR;
    __IO uint32_t SLADDR0FCLR;
    __IO uint32_t SLADDR1FCLR;
    __IO uint32_t TENDFCLR;
    __IO uint32_t STOPFCLR;
    uint32_t RESERVED0[1];
    __IO uint32_t RFULLFCLR;
    __IO uint32_t TEMPTYFCLR;
    uint32_t RESERVED1[1];
    __IO uint32_t ARLOFCLR;
    uint32_t RESERVED2[2];
    __IO uint32_t NACKFCLR;
    uint32_t RESERVED3[1];
    __IO uint32_t TMOUTFCLR;
    uint32_t RESERVED4[5];
    __IO uint32_t GENCALLFCLR;
    __IO uint32_t SMBDEFAULTFCLR;
    __IO uint32_t SMBHOSTFCLR;
    __IO uint32_t SMBALRTFCLR;
    uint32_t RESERVED5[8];
} stc_i2c_clr_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_i2c_dtr_bit_t;

typedef struct
{
    uint32_t RESERVED0[8];
} stc_i2c_drr_bit_t;

typedef struct
{
    uint32_t RESERVED0[4];
    __IO uint32_t DNFEN;
    __IO uint32_t ANFEN;
    uint32_t RESERVED1[26];
} stc_i2c_fltr_bit_t;

typedef struct
{
    __IO uint32_t TXE;
    __IO uint32_t TXIE;
    __IO uint32_t RXE;
    __IO uint32_t RXIE;
    __IO uint32_t EIE;
    __IO uint32_t WMS;
    __IO uint32_t ODD;
    __IO uint32_t MCKOE;
    __IO uint32_t TXBIRQWL0;
    __IO uint32_t TXBIRQWL1;
    __IO uint32_t TXBIRQWL2;
    uint32_t RESERVED0[1];
    __IO uint32_t RXBIRQWL0;
    __IO uint32_t RXBIRQWL1;
    __IO uint32_t RXBIRQWL2;
    uint32_t RESERVED1[1];
    __IO uint32_t FIFOR;
    __IO uint32_t CODECRC;
    __IO uint32_t I2SPLLSEL;
    __IO uint32_t SDOE;
    __IO uint32_t LRCKOE;
    __IO uint32_t CKOE;
    __IO uint32_t DUPLEX;
    __IO uint32_t CLKSEL;
    __IO uint32_t SRST;
    uint32_t RESERVED2[7];
} stc_i2s_ctrl_bit_t;

typedef struct
{
    __IO uint32_t TXBA;
    __IO uint32_t RXBA;
    __IO uint32_t TXBE;
    __IO uint32_t TXBF;
    __IO uint32_t RXBE;
    __IO uint32_t RXBF;
    uint32_t RESERVED0[26];
} stc_i2s_sr_bit_t;

typedef struct
{
    __IO uint32_t TXERR;
    __IO uint32_t RXERR;
    uint32_t RESERVED0[30];
} stc_i2s_er_bit_t;

typedef struct
{
    __IO uint32_t I2SSTD0;
    __IO uint32_t I2SSTD1;
    __IO uint32_t DATLEN0;
    __IO uint32_t DATLEN1;
    __IO uint32_t CHLEN;
    __IO uint32_t PCMSYNC;
    uint32_t RESERVED0[26];
} stc_i2s_cfgr_bit_t;

typedef struct
{
    __IO uint32_t SWDTAUTS;
    __IO uint32_t SWDTITS;
    __IO uint32_t SWDTPERI0;
    __IO uint32_t SWDTPERI1;
    __IO uint32_t SWDTCKS0;
    __IO uint32_t SWDTCKS1;
    __IO uint32_t SWDTCKS2;
    __IO uint32_t SWDTCKS3;
    __IO uint32_t SWDTWDPT0;
    __IO uint32_t SWDTWDPT1;
    __IO uint32_t SWDTWDPT2;
    __IO uint32_t SWDTWDPT3;
    __IO uint32_t SWDTSLPOFF;
    uint32_t RESERVED0[3];
    __IO uint32_t WDTAUTS;
    __IO uint32_t WDTITS;
    __IO uint32_t WDTPERI0;
    __IO uint32_t WDTPERI1;
    __IO uint32_t WDTCKS0;
    __IO uint32_t WDTCKS1;
    __IO uint32_t WDTCKS2;
    __IO uint32_t WDTCKS3;
    __IO uint32_t WDTWDPT0;
    __IO uint32_t WDTWDPT1;
    __IO uint32_t WDTWDPT2;
    __IO uint32_t WDTWDPT3;
    __IO uint32_t WDTSLPOFF;
    uint32_t RESERVED1[3];
} stc_icg_icg0_bit_t;

typedef struct
{
    __IO uint32_t HRCFREQSEL;
    uint32_t RESERVED0[7];
    __IO uint32_t HRCSTOP;
    uint32_t RESERVED1[7];
    __IO uint32_t BOR_LEV0;
    __IO uint32_t BOR_LEV1;
    __IO uint32_t BORDIS;
    uint32_t RESERVED2[13];
} stc_icg_icg1_bit_t;

typedef struct
{
    uint32_t RESERVED0[1];
    __IO uint32_t SWDTENR;
    __IO uint32_t PVD1ENR;
    __IO uint32_t PVD2ENR;
    __IO uint32_t XTAL32STPENR;
    __IO uint32_t XTALSTPENR;
    uint32_t RESERVED1[2];
    __IO uint32_t REPENR;
    __IO uint32_t RECCENR;
    __IO uint32_t BUSMENR;
    __IO uint32_t WDTENR;
    uint32_t RESERVED2[20];
} stc_intc_nmienr_bit_t;

typedef struct
{
    uint32_t RESERVED0[1];
    __IO uint32_t SWDTFR;
    __IO uint32_t PVD1FR;
    __IO uint32_t PVD2FR;
    __IO uint32_t XTAL32STPFR;
    __IO uint32_t XTALSTPFR;
    uint32_t RESERVED1[2];
    __IO uint32_t REPFR;
    __IO uint32_t RECCFR;
    __IO uint32_t BUSMFR;
    __IO uint32_t WDTFR;
    uint32_t RESERVED2[20];
} stc_intc_nmifr_bit_t;

typedef struct
{
    uint32_t RESERVED0[1];
    __IO uint32_t SWDTCFR;
    __IO uint32_t PVD1CFR;
    __IO uint32_t PVD2CFR;
    __IO uint32_t XTAL32STPCFR;
    __IO uint32_t XTALSTPCFR;
    uint32_t RESERVED1[2];
    __IO uint32_t REPCFR;
    __IO uint32_t RECCCFR;
    __IO uint32_t BUSMCFR;
    __IO uint32_t WDTCFR;
    uint32_t RESERVED2[20];
} stc_intc_nmicfr_bit_t;

typedef struct
{
    __IO uint32_t EIRQTRG0;
    __IO uint32_t EIRQTRG1;
    uint32_t RESERVED0[2];
    __IO uint32_t EISMPCLK0;
    __IO uint32_t EISMPCLK1;
    uint32_t RESERVED1[1];
    __IO uint32_t EFEN;
    uint32_t RESERVED2[7];
    __IO uint32_t NOCEN;
    uint32_t RESERVED3[16];
} stc_intc_eirqcr_bit_t;

typedef struct
{
    __IO uint32_t EIRQWUEN0;
    __IO uint32_t EIRQWUEN1;
    __IO uint32_t EIRQWUEN2;
    __IO uint32_t EIRQWUEN3;
    __IO uint32_t EIRQWUEN4;
    __IO uint32_t EIRQWUEN5;
    __IO uint32_t EIRQWUEN6;
    __IO uint32_t EIRQWUEN7;
    __IO uint32_t EIRQWUEN8;
    __IO uint32_t EIRQWUEN9;
    __IO uint32_t EIRQWUEN10;
    __IO uint32_t EIRQWUEN11;
    __IO uint32_t EIRQWUEN12;
    __IO uint32_t EIRQWUEN13;
    __IO uint32_t EIRQWUEN14;
    __IO uint32_t EIRQWUEN15;
    __IO uint32_t SWDTWUEN;
    __IO uint32_t PVD1WUEN;
    __IO uint32_t PVD2WUEN;
    __IO uint32_t CMPWUEN;
    __IO uint32_t WKTMWUEN;
    __IO uint32_t RTCALMWUEN;
    __IO uint32_t RTCPRDWUEN;
    __IO uint32_t TMR0GCMWUEN;
    __IO uint32_t TMR2GCMWUEN;
    __IO uint32_t TMR2OVFWUEN;
    __IO uint32_t RXWUEN;
    __IO uint32_t USHWUEN;
    __IO uint32_t USFWUEN;
    __IO uint32_t ETHWUEN;
    uint32_t RESERVED0[2];
} stc_intc_wupen_bit_t;

typedef struct
{
    __IO uint32_t EIFR0;
    __IO uint32_t EIFR1;
    __IO uint32_t EIFR2;
    __IO uint32_t EIFR3;
    __IO uint32_t EIFR4;
    __IO uint32_t EIFR5;
    __IO uint32_t EIFR6;
    __IO uint32_t EIFR7;
    __IO uint32_t EIFR8;
    __IO uint32_t EIFR9;
    __IO uint32_t EIFR10;
    __IO uint32_t EIFR11;
    __IO uint32_t EIFR12;
    __IO uint32_t EIFR13;
    __IO uint32_t EIFR14;
    __IO uint32_t EIFR15;
    uint32_t RESERVED0[16];
} stc_intc_eifr_bit_t;

typedef struct
{
    __IO uint32_t EICFR0;
    __IO uint32_t EICFR1;
    __IO uint32_t EICFR2;
    __IO uint32_t EICFR3;
    __IO uint32_t EICFR4;
    __IO uint32_t EICFR5;
    __IO uint32_t EICFR6;
    __IO uint32_t EICFR7;
    __IO uint32_t EICFR8;
    __IO uint32_t EICFR9;
    __IO uint32_t EICFR10;
    __IO uint32_t EICFR11;
    __IO uint32_t EICFR12;
    __IO uint32_t EICFR13;
    __IO uint32_t EICFR14;
    __IO uint32_t EICFR15;
    uint32_t RESERVED0[16];
} stc_intc_eicfr_bit_t;

typedef struct
{
    __IO uint32_t VSEL0;
    __IO uint32_t VSEL1;
    __IO uint32_t VSEL2;
    __IO uint32_t VSEL3;
    __IO uint32_t VSEL4;
    __IO uint32_t VSEL5;
    __IO uint32_t VSEL6;
    __IO uint32_t VSEL7;
    __IO uint32_t VSEL8;
    __IO uint32_t VSEL9;
    __IO uint32_t VSEL10;
    __IO uint32_t VSEL11;
    __IO uint32_t VSEL12;
    __IO uint32_t VSEL13;
    __IO uint32_t VSEL14;
    __IO uint32_t VSEL15;
    __IO uint32_t VSEL16;
    __IO uint32_t VSEL17;
    __IO uint32_t VSEL18;
    __IO uint32_t VSEL19;
    __IO uint32_t VSEL20;
    __IO uint32_t VSEL21;
    __IO uint32_t VSEL22;
    __IO uint32_t VSEL23;
    __IO uint32_t VSEL24;
    __IO uint32_t VSEL25;
    __IO uint32_t VSEL26;
    __IO uint32_t VSEL27;
    __IO uint32_t VSEL28;
    __IO uint32_t VSEL29;
    __IO uint32_t VSEL30;
    __IO uint32_t VSEL31;
} stc_intc_vssel_bit_t;

typedef struct
{
    __IO uint32_t SWIE0;
    __IO uint32_t SWIE1;
    __IO uint32_t SWIE2;
    __IO uint32_t SWIE3;
    __IO uint32_t SWIE4;
    __IO uint32_t SWIE5;
    __IO uint32_t SWIE6;
    __IO uint32_t SWIE7;
    __IO uint32_t SWIE8;
    __IO uint32_t SWIE9;
    __IO uint32_t SWIE10;
    __IO uint32_t SWIE11;
    __IO uint32_t SWIE12;
    __IO uint32_t SWIE13;
    __IO uint32_t SWIE14;
    __IO uint32_t SWIE15;
    __IO uint32_t SWIE16;
    __IO uint32_t SWIE17;
    __IO uint32_t SWIE18;
    __IO uint32_t SWIE19;
    __IO uint32_t SWIE20;
    __IO uint32_t SWIE21;
    __IO uint32_t SWIE22;
    __IO uint32_t SWIE23;
    __IO uint32_t SWIE24;
    __IO uint32_t SWIE25;
    __IO uint32_t SWIE26;
    __IO uint32_t SWIE27;
    __IO uint32_t SWIE28;
    __IO uint32_t SWIE29;
    __IO uint32_t SWIE30;
    __IO uint32_t SWIE31;
} stc_intc_swier_bit_t;

typedef struct
{
    __IO uint32_t EVTE0;
    __IO uint32_t EVTE1;
    __IO uint32_t EVTE2;
    __IO uint32_t EVTE3;
    __IO uint32_t EVTE4;
    __IO uint32_t EVTE5;
    __IO uint32_t EVTE6;
    __IO uint32_t EVTE7;
    __IO uint32_t EVTE8;
    __IO uint32_t EVTE9;
    __IO uint32_t EVTE10;
    __IO uint32_t EVTE11;
    __IO uint32_t EVTE12;
    __IO uint32_t EVTE13;
    __IO uint32_t EVTE14;
    __IO uint32_t EVTE15;
    __IO uint32_t EVTE16;
    __IO uint32_t EVTE17;
    __IO uint32_t EVTE18;
    __IO uint32_t EVTE19;
    __IO uint32_t EVTE20;
    __IO uint32_t EVTE21;
    __IO uint32_t EVTE22;
    __IO uint32_t EVTE23;
    __IO uint32_t EVTE24;
    __IO uint32_t EVTE25;
    __IO uint32_t EVTE26;
    __IO uint32_t EVTE27;
    __IO uint32_t EVTE28;
    __IO uint32_t EVTE29;
    __IO uint32_t EVTE30;
    __IO uint32_t EVTE31;
} stc_intc_evter_bit_t;

typedef struct
{
    __IO uint32_t IER0;
    __IO uint32_t IER1;
    __IO uint32_t IER2;
    __IO uint32_t IER3;
    __IO uint32_t IER4;
    __IO uint32_t IER5;
    __IO uint32_t IER6;
    __IO uint32_t IER7;
    __IO uint32_t IER8;
    __IO uint32_t IER9;
    __IO uint32_t IER10;
    __IO uint32_t IER11;
    __IO uint32_t IER12;
    __IO uint32_t IER13;
    __IO uint32_t IER14;
    __IO uint32_t IER15;
    __IO uint32_t IER16;
    __IO uint32_t IER17;
    __IO uint32_t IER18;
    __IO uint32_t IER19;
    __IO uint32_t IER20;
    __IO uint32_t IER21;
    __IO uint32_t IER22;
    __IO uint32_t IER23;
    __IO uint32_t IER24;
    __IO uint32_t IER25;
    __IO uint32_t IER26;
    __IO uint32_t IER27;
    __IO uint32_t IER28;
    __IO uint32_t IER29;
    __IO uint32_t IER30;
    __IO uint32_t IER31;
} stc_intc_ier_bit_t;

typedef struct
{
    __IO uint32_t KEYINSEL0;
    __IO uint32_t KEYINSEL1;
    __IO uint32_t KEYINSEL2;
    __IO uint32_t KEYINSEL3;
    __IO uint32_t KEYINSEL4;
    __IO uint32_t KEYINSEL5;
    __IO uint32_t KEYINSEL6;
    __IO uint32_t KEYINSEL7;
    __IO uint32_t KEYINSEL8;
    __IO uint32_t KEYINSEL9;
    __IO uint32_t KEYINSEL10;
    __IO uint32_t KEYINSEL11;
    __IO uint32_t KEYINSEL12;
    __IO uint32_t KEYINSEL13;
    __IO uint32_t KEYINSEL14;
    __IO uint32_t KEYINSEL15;
    uint32_t RESERVED0[4];
    __IO uint32_t CKSEL0;
    __IO uint32_t CKSEL1;
    uint32_t RESERVED1[10];
} stc_keyscan_scr_bit_t;

typedef struct
{
    __IO uint32_t SEN;
    uint32_t RESERVED0[31];
} stc_keyscan_ser_bit_t;

typedef struct
{
    __IO uint32_t START;
    __IO uint32_t INTEN;
    uint32_t RESERVED0[1];
    __IO uint32_t BUSY;
    uint32_t RESERVED1[28];
} stc_mau_csr_bit_t;

typedef struct
{
    __IO uint32_t MPURGSIZE0;
    __IO uint32_t MPURGSIZE1;
    __IO uint32_t MPURGSIZE2;
    __IO uint32_t MPURGSIZE3;
    __IO uint32_t MPURGSIZE4;
    uint32_t RESERVED0[27];
} stc_mpu_rgd_bit_t;

typedef struct
{
    __IO uint32_t SMPU1EAF;
    __IO uint32_t SMPU2EAF;
    __IO uint32_t FMPUEAF;
    __IO uint32_t HMPUEAF;
    __IO uint32_t EMPUEAF;
    uint32_t RESERVED0[27];
} stc_mpu_sr_bit_t;

typedef struct
{
    __IO uint32_t SMPU1ECLR;
    __IO uint32_t SMPU2ECLR;
    __IO uint32_t FMPUECLR;
    __IO uint32_t HMPUECLR;
    __IO uint32_t EMPUECLR;
    uint32_t RESERVED0[27];
} stc_mpu_eclr_bit_t;

typedef struct
{
    __IO uint32_t MPUWE;
    uint32_t RESERVED0[31];
} stc_mpu_wp_bit_t;

typedef struct
{
    __IO uint32_t AESRDP;
    __IO uint32_t AESWRP;
    __IO uint32_t HASHRDP;
    __IO uint32_t HASHWRP;
    __IO uint32_t TRNGRDP;
    __IO uint32_t TRNGWRP;
    __IO uint32_t CRCRDP;
    __IO uint32_t CRCWRP;
    __IO uint32_t FMCRDP;
    __IO uint32_t FMCWRP;
    uint32_t RESERVED0[2];
    __IO uint32_t WDTRDP;
    __IO uint32_t WDTWRP;
    __IO uint32_t SWDTRDP;
    __IO uint32_t SWDTWRP;
    __IO uint32_t BKSRAMRDP;
    __IO uint32_t BKSRAMWRP;
    __IO uint32_t RTCRDP;
    __IO uint32_t RTCWRP;
    __IO uint32_t DMPURDP;
    __IO uint32_t DMPUWRP;
    __IO uint32_t SRAMCRDP;
    __IO uint32_t SRAMCWRP;
    __IO uint32_t INTCRDP;
    __IO uint32_t INTCWRP;
    __IO uint32_t SYSCRDP;
    __IO uint32_t SYSCWRP;
    __IO uint32_t MSTPRDP;
    __IO uint32_t MSPTWRP;
    uint32_t RESERVED1[1];
    __IO uint32_t BUSERRE;
} stc_mpu_ippr_bit_t;

typedef struct
{
    __IO uint32_t S1RG0E;
    __IO uint32_t S1RG1E;
    __IO uint32_t S1RG2E;
    __IO uint32_t S1RG3E;
    __IO uint32_t S1RG4E;
    __IO uint32_t S1RG5E;
    __IO uint32_t S1RG6E;
    __IO uint32_t S1RG7E;
    __IO uint32_t S1RG8E;
    __IO uint32_t S1RG9E;
    __IO uint32_t S1RG10E;
    __IO uint32_t S1RG11E;
    __IO uint32_t S1RG12E;
    __IO uint32_t S1RG13E;
    __IO uint32_t S1RG14E;
    __IO uint32_t S1RG15E;
    uint32_t RESERVED0[16];
} stc_mpu_s1rge_bit_t;

typedef struct
{
    __IO uint32_t S1RG0WP;
    __IO uint32_t S1RG1WP;
    __IO uint32_t S1RG2WP;
    __IO uint32_t S1RG3WP;
    __IO uint32_t S1RG4WP;
    __IO uint32_t S1RG5WP;
    __IO uint32_t S1RG6WP;
    __IO uint32_t S1RG7WP;
    __IO uint32_t S1RG8WP;
    __IO uint32_t S1RG9WP;
    __IO uint32_t S1RG10WP;
    __IO uint32_t S1RG11WP;
    __IO uint32_t S1RG12WP;
    __IO uint32_t S1RG13WP;
    __IO uint32_t S1RG14WP;
    __IO uint32_t S1RG15WP;
    uint32_t RESERVED0[16];
} stc_mpu_s1rgwp_bit_t;

typedef struct
{
    __IO uint32_t S1RG0RP;
    __IO uint32_t S1RG1RP;
    __IO uint32_t S1RG2RP;
    __IO uint32_t S1RG3RP;
    __IO uint32_t S1RG4RP;
    __IO uint32_t S1RG5RP;
    __IO uint32_t S1RG6RP;
    __IO uint32_t S1RG7RP;
    __IO uint32_t S1RG8RP;
    __IO uint32_t S1RG9RP;
    __IO uint32_t S1RG10RP;
    __IO uint32_t S1RG11RP;
    __IO uint32_t S1RG12RP;
    __IO uint32_t S1RG13RP;
    __IO uint32_t S1RG14RP;
    __IO uint32_t S1RG15RP;
    uint32_t RESERVED0[16];
} stc_mpu_s1rgrp_bit_t;

typedef struct
{
    __IO uint32_t SMPU1BRP;
    __IO uint32_t SMPU1BWP;
    __IO uint32_t SMPU1ACT0;
    __IO uint32_t SMPU1ACT1;
    uint32_t RESERVED0[3];
    __IO uint32_t SMPU1E;
    uint32_t RESERVED1[24];
} stc_mpu_s1cr_bit_t;

typedef struct
{
    __IO uint32_t S2RG0E;
    __IO uint32_t S2RG1E;
    __IO uint32_t S2RG2E;
    __IO uint32_t S2RG3E;
    __IO uint32_t S2RG4E;
    __IO uint32_t S2RG5E;
    __IO uint32_t S2RG6E;
    __IO uint32_t S2RG7E;
    __IO uint32_t S2RG8E;
    __IO uint32_t S2RG9E;
    __IO uint32_t S2RG10E;
    __IO uint32_t S2RG11E;
    __IO uint32_t S2RG12E;
    __IO uint32_t S2RG13E;
    __IO uint32_t S2RG14E;
    __IO uint32_t S2RG15E;
    uint32_t RESERVED0[16];
} stc_mpu_s2rge_bit_t;

typedef struct
{
    __IO uint32_t S2RG0WP;
    __IO uint32_t S2RG1WP;
    __IO uint32_t S2RG2WP;
    __IO uint32_t S2RG3WP;
    __IO uint32_t S2RG4WP;
    __IO uint32_t S2RG5WP;
    __IO uint32_t S2RG6WP;
    __IO uint32_t S2RG7WP;
    __IO uint32_t S2RG8WP;
    __IO uint32_t S2RG9WP;
    __IO uint32_t S2RG10WP;
    __IO uint32_t S2RG11WP;
    __IO uint32_t S2RG12WP;
    __IO uint32_t S2RG13WP;
    __IO uint32_t S2RG14WP;
    __IO uint32_t S2RG15WP;
    uint32_t RESERVED0[16];
} stc_mpu_s2rgwp_bit_t;

typedef struct
{
    __IO uint32_t S2RG0RP;
    __IO uint32_t S2RG1RP;
    __IO uint32_t S2RG2RP;
    __IO uint32_t S2RG3RP;
    __IO uint32_t S2RG4RP;
    __IO uint32_t S2RG5RP;
    __IO uint32_t S2RG6RP;
    __IO uint32_t S2RG7RP;
    __IO uint32_t S2RG8RP;
    __IO uint32_t S2RG9RP;
    __IO uint32_t S2RG10RP;
    __IO uint32_t S2RG11RP;
    __IO uint32_t S2RG12RP;
    __IO uint32_t S2RG13RP;
    __IO uint32_t S2RG14RP;
    __IO uint32_t S2RG15RP;
    uint32_t RESERVED0[16];
} stc_mpu_s2rgrp_bit_t;

typedef struct
{
    __IO uint32_t SMPU2BRP;
    __IO uint32_t SMPU2BWP;
    __IO uint32_t SMPU2ACT0;
    __IO uint32_t SMPU2ACT1;
    uint32_t RESERVED0[3];
    __IO uint32_t SMPU2E;
    uint32_t RESERVED1[24];
} stc_mpu_s2cr_bit_t;

typedef struct
{
    __IO uint32_t FRG0E;
    __IO uint32_t FRG1E;
    __IO uint32_t FRG2E;
    __IO uint32_t FRG3E;
    __IO uint32_t FRG4E;
    __IO uint32_t FRG5E;
    __IO uint32_t FRG6E;
    __IO uint32_t FRG7E;
    uint32_t RESERVED0[24];
} stc_mpu_frge_bit_t;

typedef struct
{
    __IO uint32_t FRG0WP;
    __IO uint32_t FRG1WP;
    __IO uint32_t FRG2WP;
    __IO uint32_t FRG3WP;
    __IO uint32_t FRG4WP;
    __IO uint32_t FRG5WP;
    __IO uint32_t FRG6WP;
    __IO uint32_t FRG7WP;
    uint32_t RESERVED0[24];
} stc_mpu_frgwp_bit_t;

