SoCXin/HC32F4A0/src/hc32f4a0rgtb_template/common/hc32f4a0rgtb.h
typedef struct
{
    stc_aos_intsfttrg_bit_t                  INTSFTTRG_b;
    stc_aos_dcu_trgsel_bit_t                 DCU_TRGSEL1_b;
    stc_aos_dcu_trgsel_bit_t                 DCU_TRGSEL2_b;
    stc_aos_dcu_trgsel_bit_t                 DCU_TRGSEL3_b;
    stc_aos_dcu_trgsel_bit_t                 DCU_TRGSEL4_b;
    stc_aos_dma1_trgsel_bit_t                DMA1_TRGSEL0_b;
    stc_aos_dma1_trgsel_bit_t                DMA1_TRGSEL1_b;
    stc_aos_dma1_trgsel_bit_t                DMA1_TRGSEL2_b;
    stc_aos_dma1_trgsel_bit_t                DMA1_TRGSEL3_b;
    stc_aos_dma1_trgsel_bit_t                DMA1_TRGSEL4_b;
    stc_aos_dma1_trgsel_bit_t                DMA1_TRGSEL5_b;
    stc_aos_dma1_trgsel_bit_t                DMA1_TRGSEL6_b;
    stc_aos_dma1_trgsel_bit_t                DMA1_TRGSEL7_b;
    stc_aos_dma2_trgsel_bit_t                DMA2_TRGSEL0_b;
    stc_aos_dma2_trgsel_bit_t                DMA2_TRGSEL1_b;
    stc_aos_dma2_trgsel_bit_t                DMA2_TRGSEL2_b;
    stc_aos_dma2_trgsel_bit_t                DMA2_TRGSEL3_b;
    stc_aos_dma2_trgsel_bit_t                DMA2_TRGSEL4_b;
    stc_aos_dma2_trgsel_bit_t                DMA2_TRGSEL5_b;
    stc_aos_dma2_trgsel_bit_t                DMA2_TRGSEL6_b;
    stc_aos_dma2_trgsel_bit_t                DMA2_TRGSEL7_b;
    stc_aos_dma_trgselrc_bit_t               DMA_TRGSELRC_b;
    stc_aos_tmr6_htssr_bit_t                 TMR6_HTSSR1_b;
    stc_aos_tmr6_htssr_bit_t                 TMR6_HTSSR2_b;
    stc_aos_tmr6_htssr_bit_t                 TMR6_HTSSR3_b;
    stc_aos_tmr6_htssr_bit_t                 TMR6_HTSSR4_b;
    stc_aos_pevnttrgsr_bit_t                 PEVNTTRGSR12_b;
    stc_aos_pevnttrgsr_bit_t                 PEVNTTRGSR34_b;
    stc_aos_tmr0_htssr_bit_t                 TMR0_HTSSR_b;
    stc_aos_tmr2_htssr_bit_t                 TMR2_HTSSR_b;
    stc_aos_hash_itrgsela_bit_t              HASH_ITRGSELA_b;
    stc_aos_hash_itrgselb_bit_t              HASH_ITRGSELB_b;
    stc_aos_tmra_htssr_bit_t                 TMRA_HTSSR0_b;
    stc_aos_tmra_htssr_bit_t                 TMRA_HTSSR1_b;
    stc_aos_tmra_htssr_bit_t                 TMRA_HTSSR2_b;
    stc_aos_tmra_htssr_bit_t                 TMRA_HTSSR3_b;
    stc_aos_ots_trg_bit_t                    OTS_TRG_b;
    stc_aos_adc1_itrgselr_bit_t              ADC1_ITRGSELR0_b;
    stc_aos_adc1_itrgselr_bit_t              ADC1_ITRGSELR1_b;
    stc_aos_adc2_itrgselr_bit_t              ADC2_ITRGSELR0_b;
    stc_aos_adc2_itrgselr_bit_t              ADC2_ITRGSELR1_b;
    stc_aos_adc3_itrgselr_bit_t              ADC3_ITRGSELR0_b;
    stc_aos_adc3_itrgselr_bit_t              ADC3_ITRGSELR1_b;
    uint32_t                                 RESERVED0[672];
    stc_aos_pevntdirr_bit_t                  PEVNTDIRR1_b;
    stc_aos_pevntidr_bit_t                   PEVNTIDR1_b;
    stc_aos_pevntodr_bit_t                   PEVNTODR1_b;
    stc_aos_pevntorr_bit_t                   PEVNTORR1_b;
    stc_aos_pevntosr_bit_t                   PEVNTOSR1_b;
    stc_aos_pevntrisr_bit_t                  PEVNTRISR1_b;
    stc_aos_pevntfal_bit_t                   PEVNTFAL1_b;
    stc_aos_pevntdirr_bit_t                  PEVNTDIRR2_b;
    stc_aos_pevntidr_bit_t                   PEVNTIDR2_b;
    stc_aos_pevntodr_bit_t                   PEVNTODR2_b;
    stc_aos_pevntorr_bit_t                   PEVNTORR2_b;
    stc_aos_pevntosr_bit_t                   PEVNTOSR2_b;
    stc_aos_pevntrisr_bit_t                  PEVNTRISR2_b;
    stc_aos_pevntfal_bit_t                   PEVNTFAL2_b;
    stc_aos_pevntdirr_bit_t                  PEVNTDIRR3_b;
    stc_aos_pevntidr_bit_t                   PEVNTIDR3_b;
    stc_aos_pevntodr_bit_t                   PEVNTODR3_b;
    stc_aos_pevntorr_bit_t                   PEVNTORR3_b;
    stc_aos_pevntosr_bit_t                   PEVNTOSR3_b;
    stc_aos_pevntrisr_bit_t                  PEVNTRISR3_b;
    stc_aos_pevntfal_bit_t                   PEVNTFAL3_b;
    stc_aos_pevntdirr_bit_t                  PEVNTDIRR4_b;
    stc_aos_pevntidr_bit_t                   PEVNTIDR4_b;
    stc_aos_pevntodr_bit_t                   PEVNTODR4_b;
    stc_aos_pevntorr_bit_t                   PEVNTORR4_b;
    stc_aos_pevntosr_bit_t                   PEVNTOSR4_b;
    stc_aos_pevntrisr_bit_t                  PEVNTRISR4_b;
    stc_aos_pevntfal_bit_t                   PEVNTFAL4_b;
    stc_aos_pevntnfcr_bit_t                  PEVNTNFCR_b;
} bM4_AOS_TypeDef;

typedef struct
{
    uint32_t                                 RESERVED0[1280];
    stc_can_cfg_stat_bit_t                   CFG_STAT_b;
    stc_can_tcmd_bit_t                       TCMD_b;
    stc_can_tctrl_bit_t                      TCTRL_b;
    stc_can_rctrl_bit_t                      RCTRL_b;
    stc_can_rtie_bit_t                       RTIE_b;
    stc_can_rtif_bit_t                       RTIF_b;
    stc_can_errint_bit_t                     ERRINT_b;
    uint32_t                                 RESERVED1[80];
    stc_can_tdc_bit_t                        TDC_b;
    uint32_t                                 RESERVED2[16];
    stc_can_acfctrl_bit_t                    ACFCTRL_b;
    uint32_t                                 RESERVED3[8];
    stc_can_acfen_bit_t                      ACFEN_b;
    stc_can_acf_bit_t                        ACF_b;
    uint32_t                                 RESERVED4[16];
    stc_can_tbslot_bit_t                     TBSLOT_b;
    stc_can_ttcfg_bit_t                      TTCFG_b;
    stc_can_ref_msg_bit_t                    REF_MSG_b;
} bM4_CAN_TypeDef;

typedef struct
{
    stc_cmp_mdr_bit_t                        MDR_b;
    stc_cmp_fir_bit_t                        FIR_b;
    stc_cmp_ocr_bit_t                        OCR_b;
    stc_cmp_pmsr_bit_t                       PMSR_b;
    stc_cmp_twsr_bit_t                       TWSR_b;
    stc_cmp_twpr_bit_t                       TWPR_b;
    stc_cmp_visr_bit_t                       VISR_b;
} bM4_CMP_TypeDef;

typedef struct
{
    stc_cmu_xtal32cr_bit_t                   XTAL32CR_b;
    uint32_t                                 RESERVED0[216];
    stc_cmu_lrccr_bit_t                      LRCCR_b;
    uint32_t                                 RESERVED1[24];
    stc_cmu_rtclrccr_bit_t                   RTCLRCCR_b;
    uint32_t                                 RESERVED2[17080];
    stc_cmu_xtalcfgr_bit_t                   XTALCFGR_b;
    uint32_t                                 RESERVED3[236936];
    stc_cmu_pllhcr_bit_t                     PLLHCR_b;
    uint32_t                                 RESERVED4[24];
    stc_cmu_pllacr_bit_t                     PLLACR_b;
    uint32_t                                 RESERVED5[24];
    stc_cmu_xtalcr_bit_t                     XTALCR_b;
    uint32_t                                 RESERVED6[24];
    stc_cmu_hrccr_bit_t                      HRCCR_b;
    uint32_t                                 RESERVED7[8];
    stc_cmu_mrccr_bit_t                      MRCCR_b;
    uint32_t                                 RESERVED8[24];
    stc_cmu_oscstbsr_bit_t                   OSCSTBSR_b;
    stc_cmu_mco1cfgr_bit_t                   MCO1CFGR_b;
    stc_cmu_mco2cfgr_bit_t                   MCO2CFGR_b;
    stc_cmu_tpiuckcfgr_bit_t                 TPIUCKCFGR_b;
    stc_cmu_xtalstdcr_bit_t                  XTALSTDCR_b;
    stc_cmu_xtalstdsr_bit_t                  XTALSTDSR_b;
    uint32_t                                 RESERVED9[1520];
    stc_cmu_pllhcfgr_bit_t                   PLLHCFGR_b;
} bM4_CMU_TypeDef;

typedef struct
{
    stc_crc_cr_bit_t                         CR_b;
} bM4_CRC_TypeDef;

typedef struct
{
    stc_ctc_cr1_bit_t                        CR1_b;
    stc_ctc_cr2_bit_t                        CR2_b;
    stc_ctc_str_bit_t                        STR_b;
} bM4_CTC_TypeDef;

typedef struct
{
    uint32_t                                 RESERVED0[32];
    stc_dac_dacr_bit_t                       DACR_b;
    stc_dac_daadpcr_bit_t                    DAADPCR_b;
    uint32_t                                 RESERVED1[160];
    stc_dac_daocr_bit_t                      DAOCR_b;
} bM4_DAC_TypeDef;

typedef struct
{
    stc_dcu_ctl_bit_t                        CTL_b;
    stc_dcu_flag_bit_t                       FLAG_b;
    uint32_t                                 RESERVED0[96];
    stc_dcu_flagclr_bit_t                    FLAGCLR_b;
    stc_dcu_intevtsel_bit_t                  INTEVTSEL_b;
} bM4_DCU_TypeDef;

typedef struct
{
    stc_dma_en_bit_t                         EN_b;
    stc_dma_intstat0_bit_t                   INTSTAT0_b;
    stc_dma_intstat1_bit_t                   INTSTAT1_b;
    stc_dma_intmask0_bit_t                   INTMASK0_b;
    stc_dma_intmask1_bit_t                   INTMASK1_b;
    stc_dma_intclr0_bit_t                    INTCLR0_b;
    stc_dma_intclr1_bit_t                    INTCLR1_b;
    stc_dma_chen_bit_t                       CHEN_b;
    stc_dma_reqstat_bit_t                    REQSTAT_b;
    stc_dma_chstat_bit_t                     CHSTAT_b;
    uint32_t                                 RESERVED0[32];
    stc_dma_rcfgctl_bit_t                    RCFGCTL_b;
    uint32_t                                 RESERVED1[32];
    stc_dma_chenclr_bit_t                    CHENCLR_b;
    uint32_t                                 RESERVED2[384];
    stc_dma_chctl_bit_t                      CHCTL0_b;
    uint32_t                                 RESERVED3[512];
    stc_dma_chctl_bit_t                      CHCTL1_b;
    uint32_t                                 RESERVED4[512];
    stc_dma_chctl_bit_t                      CHCTL2_b;
    uint32_t                                 RESERVED5[512];
    stc_dma_chctl_bit_t                      CHCTL3_b;
    uint32_t                                 RESERVED6[512];
    stc_dma_chctl_bit_t                      CHCTL4_b;
    uint32_t                                 RESERVED7[512];
    stc_dma_chctl_bit_t                      CHCTL5_b;
    uint32_t                                 RESERVED8[512];
    stc_dma_chctl_bit_t                      CHCTL6_b;
    uint32_t                                 RESERVED9[512];
    stc_dma_chctl_bit_t                      CHCTL7_b;
} bM4_DMA_TypeDef;

typedef struct
{
    stc_dvp_ctr_bit_t                        CTR_b;
    uint32_t                                 RESERVED0[32];
    stc_dvp_str_bit_t                        STR_b;
    stc_dvp_ier_bit_t                        IER_b;
} bM4_DVP_TypeDef;

typedef struct
{
    uint32_t                                 RESERVED0[160];
    stc_efm_fstp_bit_t                       FSTP_b;
    stc_efm_frmc_bit_t                       FRMC_b;
    stc_efm_fwmc_bit_t                       FWMC_b;
    stc_efm_fsr_bit_t                        FSR_b;
    stc_efm_fsclr_bit_t                      FSCLR_b;
    stc_efm_fite_bit_t                       FITE_b;
    stc_efm_fswp_bit_t                       FSWP_b;
    uint32_t                                 RESERVED1[1696];
    stc_efm_mmf_remcr0_bit_t                 MMF_REMCR0_b;
    stc_efm_mmf_remcr1_bit_t                 MMF_REMCR1_b;
    uint32_t                                 RESERVED2[928];
    stc_efm_wlock_bit_t                      WLOCK_b;
    uint32_t                                 RESERVED3[96];
    stc_efm_f0nwprt0_bit_t                   F0NWPRT0_b;
    stc_efm_f0nwprt1_bit_t                   F0NWPRT1_b;
    stc_efm_f0nwprt2_bit_t                   F0NWPRT2_b;
    stc_efm_f0nwprt3_bit_t                   F0NWPRT3_b;
    stc_efm_f1nwprt0_bit_t                   F1NWPRT0_b;
    stc_efm_f1nwprt1_bit_t                   F1NWPRT1_b;
    stc_efm_f1nwprt2_bit_t                   F1NWPRT2_b;
    stc_efm_f1nwprt3_bit_t                   F1NWPRT3_b;
} bM4_EFM_TypeDef;

typedef struct
{
    stc_emb_ctl1_bit_t                       CTL1_b;
    stc_emb_ctl2_bit_t                       CTL2_b;
    stc_emb_soe_bit_t                        SOE_b;
    stc_emb_stat_bit_t                       STAT_b;
    stc_emb_statclr_bit_t                    STATCLR_b;
    stc_emb_inten_bit_t                      INTEN_b;
    stc_emb_rlssel_bit_t                     RLSSEL_b;
} bM4_EMB_TypeDef;

typedef struct
{
    uint32_t                                 RESERVED0[172160];
    stc_eth_mac_ifconfr_bit_t                MAC_IFCONFR_b;
    uint32_t                                 RESERVED1[352096];
    stc_eth_mac_configr_bit_t                MAC_CONFIGR_b;
    stc_eth_mac_fltctlr_bit_t                MAC_FLTCTLR_b;
    uint32_t                                 RESERVED2[64];
    stc_eth_mac_smiaddr_bit_t                MAC_SMIADDR_b;
    uint32_t                                 RESERVED3[32];
    stc_eth_mac_floctlr_bit_t                MAC_FLOCTLR_b;
    stc_eth_mac_vtafltr_bit_t                MAC_VTAFLTR_b;
    uint32_t                                 RESERVED4[32];
    stc_eth_mac_macstsr_bit_t                MAC_MACSTSR_b;
    uint32_t                                 RESERVED5[32];
    stc_eth_mac_pmtctlr_bit_t                MAC_PMTCTLR_b;
    uint32_t                                 RESERVED6[64];
    stc_eth_mac_intstsr_bit_t                MAC_INTSTSR_b;
    stc_eth_mac_intmskr_bit_t                MAC_INTMSKR_b;
    stc_eth_mac_macadhr0_bit_t               MAC_MACADHR0_b;
    uint32_t                                 RESERVED7[32];
    stc_eth_mac_macadhr1_bit_t               MAC_MACADHR1_b;
    uint32_t                                 RESERVED8[32];
    stc_eth_mac_macadhr2_bit_t               MAC_MACADHR2_b;
    uint32_t                                 RESERVED9[32];
    stc_eth_mac_macadhr3_bit_t               MAC_MACADHR3_b;
    uint32_t                                 RESERVED10[32];
    stc_eth_mac_macadhr4_bit_t               MAC_MACADHR4_b;
    uint32_t                                 RESERVED11[1248];
    stc_eth_mmc_mmcctlr_bit_t                MMC_MMCCTLR_b;
    stc_eth_mmc_revstsr_bit_t                MMC_REVSTSR_b;
    stc_eth_mmc_trsstsr_bit_t                MMC_TRSSTSR_b;
    stc_eth_mmc_ritctlr_bit_t                MMC_RITCTLR_b;
    stc_eth_mmc_titctlr_bit_t                MMC_TITCTLR_b;
    uint32_t                                 RESERVED12[5984];
    stc_eth_mac_l34ctlr_bit_t                MAC_L34CTLR_b;
    uint32_t                                 RESERVED13[3072];
    stc_eth_mac_vtactlr_bit_t                MAC_VTACTLR_b;
    uint32_t                                 RESERVED14[3008];
    stc_eth_ptp_tspctlr_bit_t                PTP_TSPCTLR_b;
    uint32_t                                 RESERVED15[128];
    stc_eth_ptp_tmunser_bit_t                PTP_TMUNSER_b;
    uint32_t                                 RESERVED16[128];
    stc_eth_ptp_tspstsr_bit_t                PTP_TSPSTSR_b;
    stc_eth_ptp_ppsctlr_bit_t                PTP_PPSCTLR_b;
    uint32_t                                 RESERVED17[18048];
    stc_eth_dma_busmodr_bit_t                DMA_BUSMODR_b;
    uint32_t                                 RESERVED18[128];
    stc_eth_dma_dmastsr_bit_t                DMA_DMASTSR_b;
    stc_eth_dma_oprmodr_bit_t                DMA_OPRMODR_b;
    stc_eth_dma_intenar_bit_t                DMA_INTENAR_b;
    stc_eth_dma_rfrcntr_bit_t                DMA_RFRCNTR_b;
} bM4_ETH_TypeDef;

typedef struct
{
    uint32_t                                 RESERVED0[96];
    stc_fcm_str_bit_t                        STR_b;
    uint32_t                                 RESERVED1[32];
    stc_fcm_rccr_bit_t                       RCCR_b;
    stc_fcm_rier_bit_t                       RIER_b;
    stc_fcm_sr_bit_t                         SR_b;
    stc_fcm_clr_bit_t                        CLR_b;
} bM4_FCM_TypeDef;

typedef struct
{
    stc_fmac_enr_bit_t                       ENR_b;
    uint32_t                                 RESERVED0[32];
    stc_fmac_ier_bit_t                       IER_b;
    uint32_t                                 RESERVED1[96];
    stc_fmac_str_bit_t                       STR_b;
} bM4_FMAC_TypeDef;

